### 📋 Terraform Plan Result for DEV Environment 
  
  **Working Directory:** `environments/dev`
  **Variables File:** `devterraform.tfvars`
  **Branch:** `feature-terraform`
  
  <details>
  <summary>Click to expand Terraform Plan</summary>
  
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev_acr.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.dev_acr.azurerm_key_vault_access_policy.microservice_keyvault_access must be replaced
-/+ resource "azurerm_key_vault_access_policy" "microservice_keyvault_access" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.KeyVault/vaults/kv-aks-demo-dev-01/objectId/a29d3930-0493-4950-a972-a23e1a66ce70" -> (known after apply)
      - key_permissions         = [] -> null
      - storage_permissions     = [] -> null
      ~ tenant_id               = "2ea612bd-d492-4f07-a879-80dd7d473e17" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.dev_acr.azurerm_user_assigned_identity.microservice_identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "microservice_identity" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-microservices-demo-dev"
        name                = "identity-microservices-demo-dev"
      ~ tags                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.dev_aks.azurerm_kubernetes_cluster.main will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "main" {
        id                                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ContainerService/managedClusters/aks-demo-dev"
        name                                = "aks-demo-dev"
      ~ tags                                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (32 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "system"
            tags                         = {}
            # (24 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.dev_aks.azurerm_log_analytics_workspace.main will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "main" {
        id                                      = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.OperationalInsights/workspaces/log-demo-dev"
        name                                    = "log-demo-dev"
      ~ tags                                    = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.dev_aks.azurerm_user_assigned_identity.aks_identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "aks_identity" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-demo-dev"
        name                = "identity-demo-dev"
      ~ tags                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.dev_keyvault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.dev_keyvault.data.http.current_ip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "current_ip" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://ipv4.icanhazip.com"
    }

  # module.dev_keyvault.azurerm_key_vault.keyvault will be updated in-place
  ~ resource "azurerm_key_vault" "keyvault" {
        id                              = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.KeyVault/vaults/kv-aks-demo-dev-01"
        name                            = "kv-aks-demo-dev-01"
      ~ tags                            = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
      ~ tenant_id                       = "2ea612bd-d492-4f07-a879-80dd7d473e17" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev_keyvault.azurerm_role_assignment.current_user_admin must be replaced
-/+ resource "azurerm_role_assignment" "current_user_admin" {
      ~ id                               = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.KeyVault/vaults/kv-aks-demo-dev-01/providers/Microsoft.Authorization/roleAssignments/f85a44c1-ce96-ab2a-11a5-26d52f80dc28" -> (known after apply)
      ~ name                             = "f85a44c1-ce96-ab2a-11a5-26d52f80dc28" -> (known after apply)
      ~ principal_id                     = "8b90227f-60d7-48d2-b176-daaa16b9b382" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.dev_keyvaultidentity.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.dev_keyvaultidentity.azurerm_federated_identity_credential.workload_identity will be updated in-place
  ~ resource "azurerm_federated_identity_credential" "workload_identity" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-keyvault-demo-dev/federatedIdentityCredentials/keyvault-workload-identity"
        name                = "keyvault-workload-identity"
      ~ subject             = "system:serviceaccount:dev:workload-identity-sa" -> "system:serviceaccount:default:workload-identity-sa"
        # (4 unchanged attributes hidden)
    }

  # module.dev_keyvaultidentity.azurerm_user_assigned_identity.workload_identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "workload_identity" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-keyvault-demo-dev"
        name                = "identity-keyvault-demo-dev"
      ~ tags                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.dev_networking.azurerm_network_security_group.aks_nsg will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Network/networkSecurityGroups/nsg-demo-dev"
        name                = "nsg-demo-dev"
      ~ tags                = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.dev_networking.azurerm_virtual_network.vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "vnet" {
        id                      = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Network/virtualNetworks/vnet-demo-dev"
        name                    = "vnet-demo-dev"
      ~ tags                    = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.dev_resourcegroup.azurerm_resource_group.resourcegroup[0] will be updated in-place
  ~ resource "azurerm_resource_group" "resourcegroup" {
        id       = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0"
        name     = "rg-demo-dev-0"
      ~ tags     = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dev_storageaccount.azurerm_storage_account.storage_account[0] will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/9dc0b1a6-8062-4d72-b39d-7d45d1b38ab6/resourceGroups/rg-demo-dev-0/providers/Microsoft.Storage/storageAccounts/stdemodev9e8p5ljy"
        name                              = "stdemodev9e8p5ljy"
      ~ tags                              = {
          - "BusinessUnit" = "adp"
          - "CreatedDate"  = "2025-08-25"
          - "Environment"  = "DEV"
          - "ManagedBy"    = "terraform"
          - "Owner"        = "jafar"
          - "Project"      = "DEMO"
          - "Subscription" = "jafar_devops"
        } -> (known after apply)
        # (42 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 11 to change, 2 to destroy.

  ```
  
  </details>
  
  *Pusher: @jafarsadiquebarbhuiya, Action: `pull_request`*